Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresFiles.GetAttributeFile Method
Overload List
Name | Description
GetAttributeFile(String)
 Gets a file info representing the first match in the standard property file directories.
GetAttributeFile(List<String>, String)
 Gets a file info representing the first match in the search directories.
Top
See Also
Reference
TeklaStructuresFiles Class
Tekla.Structures Namespace